[
  {
    "date": "2025-05-10",
    "session": "1",
    "therapist": "Alex B.",
    "text": "Client arrived visibly upset and initially resisted entering the therapy room (crying, pushing therapist’s hand away). Attempted to elope twice during transition; both times required blocking and redirection. Aggressive behavior observed—client hit the table and attempted to bite therapist when presented with a non-preferred activity. Used single-word requests (“car”, “cookie”) for toys and snacks. Minimal imitation; attempted one out of five modeled actions.",
    "aggression_incidents": "4",
    "elopement_attempts": "2",
    "spontaneous_requests": "6",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "5",
    "tokens": 93
  },
  {
    "date": "2025-05-12",
    "session": "2",
    "therapist": "Alex B.",
    "text": "Client required hand-over-hand assistance to sit at the table. Escaped from seat once; therapist used visual to return client. Aggression occurred during clean-up (screamed, pushed materials). Used two-word request (“want juice”) spontaneously. Needed full physical prompt for all imitation tasks.",
    "aggression_incidents": "3",
    "elopement_attempts": "1",
    "spontaneous_requests": "4",
    "imitation_trials_correct": "0",
    "imitation_trials_total": "4",
    "tokens": 63
  },
  {
    "date": "2025-05-14",
    "session": "3",
    "therapist": "Alex B.",
    "text": "Client entered with moderate protest. Verbal requests for bubbles and snack observed after therapist modeled requests. Aggression during transition from play to work (threw toy, attempted to scratch therapist). No elopement observed. No spontaneous imitation.",
    "aggression_incidents": "2",
    "elopement_attempts": "0",
    "spontaneous_requests": "5",
    "imitation_trials_correct": "0",
    "imitation_trials_total": "5",
    "tokens": 47
  },
  {
    "date": "2025-05-16",
    "session": "4",
    "therapist": "Alex B.",
    "text": "Client participated willingly in preferred activities but became aggressive when prompted to join group activity (hit therapist, knocked over chair). Used short phrases to request snack and break. Elopement attempt occurred when door was open—client bolted, therapist intercepted. Minimal progress in imitation.",
    "aggression_incidents": "3",
    "elopement_attempts": "1",
    "spontaneous_requests": "4",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "6",
    "tokens": 56
  },
  {
    "date": "2025-05-18",
    "session": "5",
    "therapist": "Alex B.",
    "text": "Client showed increased engagement with picture cards, made several spontaneous single-word requests (“cookie”, “car”, “music”). Aggression decreased—one incident during cleanup. Attempted to elope during parent pickup; therapist used stop sign and physical block. Attempted to imitate blowing bubbles with hand-over-hand.",
    "aggression_incidents": "1",
    "elopement_attempts": "1",
    "spontaneous_requests": "5",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "5",
    "tokens": 68
  },
  {
    "date": "2025-05-20",
    "session": "6",
    "therapist": "Alex B.",
    "text": "Client transitioned calmly with visual supports. Elopement attempt during play (ran to door); therapist blocked and redirected. Aggressive behavior noted when denied tablet—threw toy and screamed. Used more two-word requests (“want ball,” “need help”) than previous sessions. Needed partial prompt for imitation.",
    "aggression_incidents": "2",
    "elopement_attempts": "1",
    "spontaneous_requests": "7",
    "imitation_trials_correct": "2",
    "imitation_trials_total": "6",
    "tokens": 67
  },
  {
    "date": "2025-05-22",
    "session": "7",
    "therapist": "Alex B.",
    "text": "Client independently requested snack (“cookie please”). Aggressive behavior only observed during transitions between activities (pushed materials). Attempted to leave table twice, both blocked. Followed single-step directions with prompting. Modeled three imitation actions, completed one with minimal prompt.",
    "aggression_incidents": "1",
    "elopement_attempts": "2",
    "spontaneous_requests": "6",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "3",
    "tokens": 54
  },
  {
    "date": "2025-05-24",
    "session": "8",
    "therapist": "Alex B.",
    "text": "Client entered session smiling, greeted therapist by name. Attempted to elope once when doorbell rang. Aggression observed when required to clean up blocks (threw block at therapist). Used three spontaneous requests for preferred toys. Modeled clapping and waving—imitated both with full prompt.",
    "aggression_incidents": "2",
    "elopement_attempts": "1",
    "spontaneous_requests": "3",
    "imitation_trials_correct": "2",
    "imitation_trials_total": "4",
    "tokens": 56
  },
  {
    "date": "2025-05-26",
    "session": "9",
    "therapist": "Alex B.",
    "text": "Client required redirection to remain in therapy area, attempted to elope twice (one successful, quickly returned). Aggressive outburst when denied iPad (screamed, hit therapist). Two spontaneous requests (“more bubbles,” “cookie”). Did not attempt any modeled imitation actions.",
    "aggression_incidents": "3",
    "elopement_attempts": "2",
    "spontaneous_requests": "2",
    "imitation_trials_correct": "0",
    "imitation_trials_total": "3",
    "tokens": 60
  },
  {
    "date": "2025-05-28",
    "session": "10",
    "therapist": "Alex B.",
    "text": "Client participated in play with minimal aggression (one incident during snack routine—pushed therapist’s hand away). Attempted to leave table during group activity, blocked with visual support. Four spontaneous requests, including one three-word phrase (“want more juice”). Completed one out of four imitation trials.",
    "aggression_incidents": "1",
    "elopement_attempts": "1",
    "spontaneous_requests": "4",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "4",
    "tokens": 63
  },
  {
    "date": "2025-05-30",
    "session": "11",
    "therapist": "Alex B.",
    "text": "Client used visual schedule to transition with minimal protest. No elopement observed. Aggression during cleanup (threw toy). Used single- and two-word requests. Modeled waving, completed with partial prompt.",
    "aggression_incidents": "1",
    "elopement_attempts": "0",
    "spontaneous_requests": "5",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "3",
    "tokens": 43
  },
  {
    "date": "2025-06-01",
    "session": "12",
    "therapist": "Alex B.",
    "text": "Client displayed increased tolerance for transitions; remained seated during activities. One attempt to elope at end of session, therapist blocked. Aggression observed once (hit table). Used multiple spontaneous requests and imitated two actions with partial prompt.",
    "aggression_incidents": "1",
    "elopement_attempts": "1",
    "spontaneous_requests": "6",
    "imitation_trials_correct": "2",
    "imitation_trials_total": "4",
    "tokens": 48
  },
  {
    "date": "2025-06-03",
    "session": "13",
    "therapist": "Alex B.",
    "text": "Client engaged well in song activity, attempted to elope once. Aggressive behavior during snack denial (screamed, hit therapist’s arm). Used “help please” and “open box” spontaneously. Attempted three imitation actions, completed one with prompt.",
    "aggression_incidents": "2",
    "elopement_attempts": "1",
    "spontaneous_requests": "4",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "3",
    "tokens": 52
  },
  {
    "date": "2025-06-05",
    "session": "14",
    "therapist": "Alex B.",
    "text": "Client initiated play with therapist. One aggressive incident during work demand (pushed worksheet off table). Attempted to leave table during break; therapist redirected. Used two-word request (“want car”) and imitated clapping after prompt.",
    "aggression_incidents": "1",
    "elopement_attempts": "1",
    "spontaneous_requests": "3",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "2",
    "tokens": 53
  },
  {
    "date": "2025-06-07",
    "session": "15",
    "therapist": "Alex B.",
    "text": "Client participated calmly in routine. No aggression or elopement attempts. Used three spontaneous requests and imitated waving independently.",
    "aggression_incidents": "0",
    "elopement_attempts": "0",
    "spontaneous_requests": "3",
    "imitation_trials_correct": "1",
    "imitation_trials_total": "1",
    "tokens": 26
  }
]